; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-3-2-3-5-5-7) (:domain depots)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 - Distributor
	truck0 truck1 truck2 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear crate4)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear crate3)
	(at pallet4 distributor1)
	(clear crate6)
	(at truck0 distributor0)
	(at truck1 depot2)
	(at truck2 distributor0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at crate0 distributor0)
	(on crate0 pallet3)
	(at crate1 distributor0)
	(on crate1 crate0)
	(at crate2 depot1)
	(on crate2 pallet1)
	(at crate3 distributor0)
	(on crate3 crate1)
	(at crate4 depot1)
	(on crate4 crate2)
	(at crate5 distributor1)
	(on crate5 pallet4)
	(at crate6 distributor1)
	(on crate6 crate5)
)

(:goal (and
		(on crate0 crate3)
		(on crate1 pallet2)
		(on crate2 pallet4)
		(on crate3 crate1)
		(on crate4 pallet3)
		(on crate5 crate4)
		(on crate6 crate2)
	)
))

; plan
1. (lift hoist3 crate3 crate1 distributor0)
   deleted: (at crate3 distributor0) (available hoist3) (on crate3 crate1) (clear crate3)
   added: (lifting hoist3 crate3) (clear crate1)
   goals met: 0 of 7
2. (load hoist3 crate3 truck0 distributor0)
   deleted: (lifting hoist3 crate3)
   added: (in crate3 truck0) (available hoist3)
   goals met: 0 of 7
3. (lift hoist3 crate1 crate0 distributor0)
   deleted: (at crate1 distributor0) (available hoist3) (on crate1 crate0) (clear crate1)
   added: (lifting hoist3 crate1) (clear crate0)
   goals met: 0 of 7
4. (load hoist3 crate1 truck0 distributor0)
   deleted: (lifting hoist3 crate1)
   added: (in crate1 truck0) (available hoist3)
   goals met: 0 of 7
5. (lift hoist3 crate0 pallet3 distributor0)
   deleted: (at crate0 distributor0) (available hoist3) (on crate0 pallet3) (clear crate0)
   added: (lifting hoist3 crate0) (clear pallet3)
   goals met: 0 of 7
6. (load hoist3 crate0 truck0 distributor0)
   deleted: (lifting hoist3 crate0)
   added: (in crate0 truck0) (available hoist3)
   goals met: 0 of 7
7. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   goals met: 0 of 7
8. (unload hoist2 crate1 truck0 depot2)
   deleted: (available hoist2) (in crate1 truck0)
   added: (lifting hoist2 crate1)
   goals met: 0 of 7
9. (drop hoist2 crate1 pallet2 depot2)
   deleted: (lifting hoist2 crate1) (clear pallet2)
   added: (at crate1 depot2) (available hoist2) (on crate1 pallet2) (clear crate1)
   goals met: 1 of 7
10. (unload hoist2 crate3 truck0 depot2)
   deleted: (available hoist2) (in crate3 truck0)
   added: (lifting hoist2 crate3)
   goals met: 1 of 7
11. (drop hoist2 crate3 crate1 depot2)
   deleted: (lifting hoist2 crate3) (clear crate1)
   added: (at crate3 depot2) (available hoist2) (on crate3 crate1) (clear crate3)
   goals met: 2 of 7
12. (unload hoist2 crate0 truck0 depot2)
   deleted: (available hoist2) (in crate0 truck0)
   added: (lifting hoist2 crate0)
   goals met: 2 of 7
13. (lift hoist1 crate4 crate2 depot1)
   deleted: (at crate4 depot1) (available hoist1) (on crate4 crate2) (clear crate4)
   added: (lifting hoist1 crate4) (clear crate2)
   goals met: 2 of 7
14. (drive truck0 depot2 depot1)
   deleted: (at truck0 depot2)
   added: (at truck0 depot1)
   goals met: 2 of 7
15. (load hoist1 crate4 truck0 depot1)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck0) (available hoist1)
   goals met: 2 of 7
16. (lift hoist1 crate2 pallet1 depot1)
   deleted: (at crate2 depot1) (available hoist1) (on crate2 pallet1) (clear crate2)
   added: (lifting hoist1 crate2) (clear pallet1)
   goals met: 2 of 7
17. (load hoist1 crate2 truck0 depot1)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck0) (available hoist1)
   goals met: 2 of 7
18. (lift hoist4 crate6 crate5 distributor1)
   deleted: (at crate6 distributor1) (available hoist4) (on crate6 crate5) (clear crate6)
   added: (lifting hoist4 crate6) (clear crate5)
   goals met: 2 of 7
19. (drive truck0 depot1 distributor1)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor1)
   goals met: 2 of 7
20. (drop hoist2 crate0 crate3 depot2)
   deleted: (lifting hoist2 crate0) (clear crate3)
   added: (at crate0 depot2) (available hoist2) (on crate0 crate3) (clear crate0)
   goals met: 3 of 7
21. (load hoist4 crate6 truck0 distributor1)
   deleted: (lifting hoist4 crate6)
   added: (in crate6 truck0) (available hoist4)
   goals met: 3 of 7
22. (lift hoist4 crate5 pallet4 distributor1)
   deleted: (at crate5 distributor1) (available hoist4) (on crate5 pallet4) (clear crate5)
   added: (lifting hoist4 crate5) (clear pallet4)
   goals met: 3 of 7
23. (load hoist4 crate5 truck0 distributor1)
   deleted: (lifting hoist4 crate5)
   added: (in crate5 truck0) (available hoist4)
   goals met: 3 of 7
24. (unload hoist4 crate2 truck0 distributor1)
   deleted: (available hoist4) (in crate2 truck0)
   added: (lifting hoist4 crate2)
   goals met: 3 of 7
25. (drop hoist4 crate2 pallet4 distributor1)
   deleted: (lifting hoist4 crate2) (clear pallet4)
   added: (at crate2 distributor1) (available hoist4) (on crate2 pallet4) (clear crate2)
   goals met: 4 of 7
26. (unload hoist4 crate6 truck0 distributor1)
   deleted: (available hoist4) (in crate6 truck0)
   added: (lifting hoist4 crate6)
   goals met: 4 of 7
27. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   goals met: 4 of 7
28. (drop hoist4 crate6 crate2 distributor1)
   deleted: (lifting hoist4 crate6) (clear crate2)
   added: (at crate6 distributor1) (available hoist4) (on crate6 crate2) (clear crate6)
   goals met: 5 of 7
29. (unload hoist3 crate4 truck0 distributor0)
   deleted: (available hoist3) (in crate4 truck0)
   added: (lifting hoist3 crate4)
   goals met: 5 of 7
30. (drop hoist3 crate4 pallet3 distributor0)
   deleted: (lifting hoist3 crate4) (clear pallet3)
   added: (at crate4 distributor0) (available hoist3) (on crate4 pallet3) (clear crate4)
   goals met: 6 of 7
31. (unload hoist3 crate5 truck0 distributor0)
   deleted: (available hoist3) (in crate5 truck0)
   added: (lifting hoist3 crate5)
   goals met: 6 of 7
32. (drop hoist3 crate5 crate4 distributor0)
   deleted: (lifting hoist3 crate5) (clear crate4)
   added: (at crate5 distributor0) (available hoist3) (on crate5 crate4) (clear crate5)
   goals met: 7 of 7
